foamLia/test/exampleRun/0/T
/*--------------------------------*- C++ -*----------------------------------*
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class volScalarField;
location "0";
object T;
}

// ************************************************************************* //

dimensions [0 0 0 1 0 0 0];

internalField nonuniform List<scalar>
40000
(
311.812
310.445
308.861
307.338
305.928
304.809
303.97
303.347
...
)
;

boundaryField 
{
front 
{
type empty;
};
back 
{
type empty;
};
topinside 
{
type groovyBC;
value uniform 300;
gradientExpression "gradT";
fractionExpression "0";
variables "Text=260;hc=220;gradT=(Text-T)*hc;";
timelines ();
};
topoutside 
{
type groovyBC;
value uniform 300;
gradientExpression "gradT";
fractionExpression "0";
variables "Text=260;hc=220;gradT=(Text-T)*hc;";
timelines ();
};
bottominside 
{
type groovyBC;
value uniform 300;
gradientExpression "gradT";
fractionExpression "0";
variables "Text=350;hc=220;gradT=(Text-T)*hc;";
timelines ();
};
bottomoutside 
{
type groovyBC;
value uniform 300;
gradientExpression "gradT";
fractionExpression "0";
variables "Text=350;hc=220;gradT=(Text-T)*hc;";
timelines ();
};
};

// ************************************************************************* //

